zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32h2-pinctrl.h
/**
 * @name TWAI_RX
 * @{
 */
#define TWAI_RX_GPIO0 ESP32_PINMUX(0, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO1 ESP32_PINMUX(1, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO2 ESP32_PINMUX(2, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO3 ESP32_PINMUX(3, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO4 ESP32_PINMUX(4, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO5 ESP32_PINMUX(5, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO8 ESP32_PINMUX(8, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO9 ESP32_PINMUX(9, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO10 ESP32_PINMUX(10, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO11 ESP32_PINMUX(11, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO12 ESP32_PINMUX(12, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO13 ESP32_PINMUX(13, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO14 ESP32_PINMUX(14, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO22 ESP32_PINMUX(22, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO23 ESP32_PINMUX(23, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO24 ESP32_PINMUX(24, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO25 ESP32_PINMUX(25, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO26 ESP32_PINMUX(26, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO27 ESP32_PINMUX(27, ESP_TWAI_RX, ESP_NOSIG)
/** @} */

/**
 * @name TWAI_TX
 * @{
 */
#define TWAI_TX_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI_TX)
#define TWAI_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI_TX)
/** @} */

/**
 * @name UART0_CTS
 * @{
 */
#define UART0_CTS_GPIO0 ESP32_PINMUX(0, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO1 ESP32_PINMUX(1, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO2 ESP32_PINMUX(2, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO3 ESP32_PINMUX(3, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO4 ESP32_PINMUX(4, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO5 ESP32_PINMUX(5, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO8 ESP32_PINMUX(8, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO9 ESP32_PINMUX(9, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO10 ESP32_PINMUX(10, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO11 ESP32_PINMUX(11, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO12 ESP32_PINMUX(12, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO13 ESP32_PINMUX(13, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO14 ESP32_PINMUX(14, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO22 ESP32_PINMUX(22, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO23 ESP32_PINMUX(23, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO24 ESP32_PINMUX(24, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO25 ESP32_PINMUX(25, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO26 ESP32_PINMUX(26, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO27 ESP32_PINMUX(27, ESP_U0CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_DSR
 * @{
 */
#define UART0_DSR_GPIO0 ESP32_PINMUX(0, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO1 ESP32_PINMUX(1, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO2 ESP32_PINMUX(2, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO3 ESP32_PINMUX(3, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO4 ESP32_PINMUX(4, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO5 ESP32_PINMUX(5, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO8 ESP32_PINMUX(8, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO9 ESP32_PINMUX(9, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO10 ESP32_PINMUX(10, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO11 ESP32_PINMUX(11, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO12 ESP32_PINMUX(12, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO13 ESP32_PINMUX(13, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO14 ESP32_PINMUX(14, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO22 ESP32_PINMUX(22, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO23 ESP32_PINMUX(23, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO24 ESP32_PINMUX(24, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO25 ESP32_PINMUX(25, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO26 ESP32_PINMUX(26, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO27 ESP32_PINMUX(27, ESP_U0DSR_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_DTR
 * @{
 */
#define UART0_DTR_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0DTR_OUT)
/** @} */

/**
 * @name UART0_RTS
 * @{
 */
#define UART0_RTS_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0RTS_OUT)
/** @} */

/**
 * @name UART0_RX
 * @{
 */
#define UART0_RX_GPIO0 ESP32_PINMUX(0, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO1 ESP32_PINMUX(1, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO2 ESP32_PINMUX(2, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO3 ESP32_PINMUX(3, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO4 ESP32_PINMUX(4, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO5 ESP32_PINMUX(5, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO8 ESP32_PINMUX(8, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO9 ESP32_PINMUX(9, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO10 ESP32_PINMUX(10, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO11 ESP32_PINMUX(11, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO12 ESP32_PINMUX(12, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO13 ESP32_PINMUX(13, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO14 ESP32_PINMUX(14, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO22 ESP32_PINMUX(22, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO23 ESP32_PINMUX(23, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO24 ESP32_PINMUX(24, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO25 ESP32_PINMUX(25, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO26 ESP32_PINMUX(26, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO27 ESP32_PINMUX(27, ESP_U0RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_TX
 * @{
 */
#define UART0_TX_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0TXD_OUT)
/** @} */

/**
 * @name UART1_CTS
 * @{
 */
#define UART1_CTS_GPIO0 ESP32_PINMUX(0, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO1 ESP32_PINMUX(1, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO2 ESP32_PINMUX(2, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO3 ESP32_PINMUX(3, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO4 ESP32_PINMUX(4, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO5 ESP32_PINMUX(5, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO8 ESP32_PINMUX(8, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO9 ESP32_PINMUX(9, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO10 ESP32_PINMUX(10, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO11 ESP32_PINMUX(11, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO12 ESP32_PINMUX(12, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO13 ESP32_PINMUX(13, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO14 ESP32_PINMUX(14, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO22 ESP32_PINMUX(22, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO23 ESP32_PINMUX(23, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO24 ESP32_PINMUX(24, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO25 ESP32_PINMUX(25, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO26 ESP32_PINMUX(26, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO27 ESP32_PINMUX(27, ESP_U1CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_DSR
 * @{
 */
#define UART1_DSR_GPIO0 ESP32_PINMUX(0, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO1 ESP32_PINMUX(1, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO2 ESP32_PINMUX(2, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO3 ESP32_PINMUX(3, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO4 ESP32_PINMUX(4, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO5 ESP32_PINMUX(5, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO8 ESP32_PINMUX(8, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO9 ESP32_PINMUX(9, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO10 ESP32_PINMUX(10, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO11 ESP32_PINMUX(11, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO12 ESP32_PINMUX(12, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO13 ESP32_PINMUX(13, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO14 ESP32_PINMUX(14, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO22 ESP32_PINMUX(22, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO23 ESP32_PINMUX(23, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO24 ESP32_PINMUX(24, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO25 ESP32_PINMUX(25, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO26 ESP32_PINMUX(26, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO27 ESP32_PINMUX(27, ESP_U1DSR_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_DTR
 * @{
 */
#define UART1_DTR_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1DTR_OUT)
/** @} */

/**
 * @name UART1_RTS
 * @{
 */
#define UART1_RTS_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1RTS_OUT)
/** @} */

/**
 * @name UART1_RX
 * @{
 */
#define UART1_RX_GPIO0 ESP32_PINMUX(0, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO1 ESP32_PINMUX(1, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO2 ESP32_PINMUX(2, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO3 ESP32_PINMUX(3, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO4 ESP32_PINMUX(4, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO5 ESP32_PINMUX(5, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO8 ESP32_PINMUX(8, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO9 ESP32_PINMUX(9, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO10 ESP32_PINMUX(10, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO11 ESP32_PINMUX(11, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO12 ESP32_PINMUX(12, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO13 ESP32_PINMUX(13, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO14 ESP32_PINMUX(14, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO22 ESP32_PINMUX(22, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO23 ESP32_PINMUX(23, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO24 ESP32_PINMUX(24, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO25 ESP32_PINMUX(25, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO26 ESP32_PINMUX(26, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO27 ESP32_PINMUX(27, ESP_U1RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_TX
 * @{
 */
#define UART1_TX_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1TXD_OUT)
/** @} */

/**
 * @name SPIS2_CSEL
 * @{
 */
#define SPIS2_CSEL_GPIO0  ESP32_PINMUX(0, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO1  ESP32_PINMUX(1, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO2  ESP32_PINMUX(2, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO3  ESP32_PINMUX(3, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO4  ESP32_PINMUX(4, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO5  ESP32_PINMUX(5, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO8  ESP32_PINMUX(8, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO9  ESP32_PINMUX(9, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO22 ESP32_PINMUX(22, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO23 ESP32_PINMUX(23, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO24 ESP32_PINMUX(24, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO25 ESP32_PINMUX(25, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_FSPICS0_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_MISO
 * @{
 */
#define SPIS2_MISO_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPIQ_OUT)
/** @} */

/**
 * @name SPIS2_MOSI
 * @{
 */
#define SPIS2_MOSI_GPIO0  ESP32_PINMUX(0, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO1  ESP32_PINMUX(1, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO2  ESP32_PINMUX(2, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO3  ESP32_PINMUX(3, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO4  ESP32_PINMUX(4, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO5  ESP32_PINMUX(5, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO8  ESP32_PINMUX(8, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO9  ESP32_PINMUX(9, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO22 ESP32_PINMUX(22, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO23 ESP32_PINMUX(23, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO24 ESP32_PINMUX(24, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO25 ESP32_PINMUX(25, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO26 ESP32_PINMUX(26, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO27 ESP32_PINMUX(27, ESP_FSPID_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_SCLK
 * @{
 */
#define SPIS2_SCLK_GPIO0  ESP32_PINMUX(0, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO1  ESP32_PINMUX(1, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO2  ESP32_PINMUX(2, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO3  ESP32_PINMUX(3, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO4  ESP32_PINMUX(4, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO5  ESP32_PINMUX(5, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO8  ESP32_PINMUX(8, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO9  ESP32_PINMUX(9, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO24 ESP32_PINMUX(24, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_FSPICLK_IN, ESP_NOSIG)
/** @} */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESP32H2_PINCTRL_H_ */
